{
  "architectures": [
    "ElectraForTokenClassification"
  ],
  "model_type": "electra",
  "num_labels": 5,
  "id2label": {
    "0": "O",
    "1": "B-FOOD",
    "2": "I-FOOD",
    "3": "B-QTY",
    "4": "I-QTY"
  },
  "label2id": {
    "O": 0,
    "B-FOOD": 1,
    "I-FOOD": 2,
    "B-QTY": 3,
    "I-QTY": 4
  },
  "attention_probs_dropout_prob": 0.1,
  "embedding_size": 128,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 256,
  "initializer_range": 0.02,
  "intermediate_size": 1024,
  "max_position_embeddings": 512,
  "num_attention_heads": 4,
  "num_hidden_layers": 12,
  "type_vocab_size": 2,
  "vocab_size": 35000
}